Ran Plan for dir: `terraform/github` workspace: `default`

<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # github_repository_webhook.gitops_atlantis_webhook will be created
+ resource "github_repository_webhook" "gitops_atlantis_webhook" {
      + active     = true
      + etag       = (known after apply)
      + events     = [
          + "issue_comment",
          + "pull_request",
          + "pull_request_review",
          + "push",
        ]
      + id         = (known after apply)
      + repository = "gitops"
      + url        = (known after apply)

      + configuration {
          + content_type = "json"
          + insecure_ssl = false
          + secret       = (sensitive value)
          + url          = (sensitive value)
        }
    }

  # github_user_ssh_key.kubefirst_bot will be created
+ resource "github_user_ssh_key" "kubefirst_bot" {
      + etag  = (known after apply)
      + id    = (known after apply)
      + key   = <<-EOT
            ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIIgq3f/2DOUzidhie2f8u4UHCHG3UEFdRU+5GD6ZKdM6
        EOT
      + title = "kubefirst-bot"
      + url   = (known after apply)
    }

  # module.gitops.github_repository.repo will be created
+ resource "github_repository" "repo" {
      + allow_auto_merge       = false
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archive_on_destroy     = false
      + archived               = false
      + auto_init              = false
      + branches               = (known after apply)
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + has_issues             = true
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + is_template            = false
      + name                   = "gitops"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = "private"
    }

  # module.metaphor_megabite.github_repository.repo will be created
+ resource "github_repository" "repo" {
      + allow_auto_merge       = false
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archive_on_destroy     = false
      + archived               = false
      + auto_init              = false
      + branches               = (known after apply)
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + has_issues             = true
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + is_template            = false
      + name                   = "metaphor-megabite"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = "private"
    }

Plan: 4 to add, 0 to change, 0 to destroy.


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terraform/github`
* :put_litter_in_its_place: To **delete** this plan click [here](http://localhost:4141/lock?id=jarededwards%252Fgitops%252Fterraform%252Fgithub%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terraform/github`
</details>
Plan: 4 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
